# Actividad 26 de septiembre de 2025

**Materia**: Herramientas para el Almacenamiento de Grandes Volúmenes  
**Estudiante**: Daniel Cureño Martínez  
**Semestre**: 5to

## Objetivo
Responder las siguientes preguntas usando el conjunto de datos de transacciones financieras.

In [1]:
import pandas as pd

# Configuración básica
pd.set_option('display.max_columns', None)
pd.set_option('display.width', 1000)

## Carga de datos

In [3]:
df = pd.read_csv('transacciones_simuladas.csv')
df['monto'] = pd.to_numeric(df['monto'], errors='coerce')

# Definir ciudades mexicanas
ciudades_mexicanas = {
    'Queretaro', 'Juarez', 'Monterrey', 'Puebla', 'Merida',
    'Leon', 'Torreon', 'CDMX', 'Guadalajara', 'Tijuana',
    'Hermosillo', 'Cancun', 'Veracruz', 'Oaxaca', 'Chihuahua'
}
df['es_extranjera'] = ~df['ciudad'].isin(ciudades_mexicanas)

df.head()

   id_transaccion  id_cliente   nombre_cliente           cuenta_origen       fecha     monto divisa tipo_transaccion     ciudad          cuenta_destino categoria_comercio  es_extranjera
0               1        2783    Philip Knight  ES72380307822087479772  13/09/2025  31551.32    USD    transferencia  Queretaro  ES19946920183191759474                NaN          False
1               2        3696   William Harmon  ES74956814146097211403  16/09/2025  36889.11    MXN           retiro     Juarez                     NaN                NaN          False
2               3        6403     Amanda Lewis  ES94278160534459740595  04/07/2025  30644.10    MXN           retiro      Paris                     NaN                NaN           True
3               4        1156  Victoria Burton  ES18259905541180196560  06/09/2025   7869.29    USD           retiro     Juarez                     NaN                NaN          False
4               5        2653       Todd Young  ES59522414203568104424  03/04/2025  37940.37    MXN           retiro     Puebla                     NaN                NaN          False

### 1. Agrupar los datos por tipo de transacción

In [4]:
df['tipo_transaccion'].value_counts()

tipo_transaccion
transferencia    3370
compra           3352
retiro           3278
Name: count, dtype: int64

### 2. Ordenar los datos por monto en orden descendente (top 10)

In [5]:
df.sort_values('monto', ascending=False)[['id_transaccion', 'monto', 'tipo_transaccion']].head(10)

      id_transaccion     monto tipo_transaccion
3444            3445  49995.63           compra
5374            5375  49992.38    transferencia
3330            3331  49988.09           compra
6515            6516  49986.96           retiro
8904            8905  49981.24           compra
3697            3698  49981.06           retiro
6346            6347  49973.11           retiro
5681            5682  49965.07           retiro
3222            3223  49964.03    transferencia
7515            7516  49955.90    transferencia

### 3. Presentar todas las transacciones extranjeras (primeras 10)

In [6]:
df[df['es_extranjera']][['id_transaccion', 'ciudad', 'monto', 'tipo_transaccion']].head(10)

     id_transaccion       ciudad     monto tipo_transaccion
2                 3        Paris  30644.10           retiro
21               22       Madrid   4282.67           retiro
81               82       Brasil  38341.71           compra
151             152    Barcelona  13329.34           compra
181             182  Los Angeles   9605.27           retiro
221             222       Sidney   3196.42           compra
268             269       London  13032.16    transferencia
335             336       Bogota  36990.43    transferencia
442             443       Boston  44483.26           compra
498             499        Paris  22475.55           retiro

### 4. ¿Está la ciudad "Sudáfrica" en la lista?

In [7]:
sudafrica_presente = df['ciudad'].str.contains(r'Sud[áa]frica', case=False, na=False).any()
"Sí" if sudafrica_presente else "No"

'No'

### 5. ¿Cuál es la cantidad promedio que se retira?

In [9]:
retiros = df[df['tipo_transaccion'] == 'retiro']
retiros['monto'].mean()

24861.527211714467

### 6. ¿Cuál ha sido el retiro mayor?

In [10]:
retiros['monto'].max()

49986.96

### 7. ¿Cuántos depósitos están entre 20,000 y 35,000?

**Nota**: El dataset no contiene transacciones de tipo "depósito".  
Se asume que el profesor se refiere a "transferencia" como operación de entrada de fondos.

In [11]:
transferencias = df[df['tipo_transaccion'] == 'transferencia']
en_rango = transferencias[(transferencias['monto'] >= 20000) & (transferencias['monto'] <= 35000)]
len(en_rango)

974

### 8. Agrupar los datos por tipo de divisa

In [12]:
df.groupby('divisa').agg(
    total_transacciones=('monto', 'size'),
    monto_promedio=('monto', 'mean'),
    monto_total=('monto', 'sum')
).round(2)

        total_transacciones  monto_promedio  monto_total
divisa
EUR                    3334        25004.84  83366124.01
MXN                    3325        24690.18  82094846.65
USD                    3341        24848.67  83019394.70

### 9. Cambiar las divisas de euros a dólares

Se reemplaza la etiqueta "EUR" por "USD" en la columna `divisa`, **sin modificar los montos**.

In [14]:
df_p9 = df.copy()
df_p9['divisa'] = df_p9['divisa'].replace('EUR', 'USD')

# Mostrar ejemplo
df_p9[df['divisa'] == 'EUR'][['id_transaccion', 'monto', 'divisa']].head()

    id_transaccion     monto divisa
6                7    132.42    USD
8                9  41811.10    USD
11              12  35360.16    USD
13              14  48485.84    USD
16              17  41277.81    USD